; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-6-3-23)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	driver6 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	package1 - package
	package2 - package
	package3 - package
	package4 - package
	package5 - package
	package6 - package
	package7 - package
	package8 - package
	package9 - package
	package10 - package
	package11 - package
	package12 - package
	package13 - package
	package14 - package
	package15 - package
	package16 - package
	package17 - package
	package18 - package
	package19 - package
	package20 - package
	package21 - package
	package22 - package
	package23 - package
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	p0-1 - location
	p0-4 - location
	p0-5 - location
	p1-2 - location
	p1-3 - location
	p1-5 - location
	p1-7 - location
	p3-6 - location
	p4-0 - location
	p4-5 - location
	p4-6 - location
	p6-2 - location
	p6-5 - location
	p7-2 - location
	p7-4 - location
	)
	(:init
	(at driver1 s3)
	(at driver2 s0)
	(at driver3 s7)
	(at driver4 s7)
	(at driver5 s0)
	(at driver6 s2)
	(at truck1 s0)
	(empty truck1)
	(at truck2 s5)
	(empty truck2)
	(at truck3 s4)
	(empty truck3)
	(at package1 s1)
	(at package2 s7)
	(at package3 s4)
	(at package4 s6)
	(at package5 s7)
	(at package6 s1)
	(at package7 s2)
	(at package8 s0)
	(at package9 s6)
	(at package10 s2)
	(at package11 s6)
	(at package12 s7)
	(at package13 s4)
	(at package14 s3)
	(at package15 s1)
	(at package16 s6)
	(at package17 s2)
	(at package18 s6)
	(at package19 s6)
	(at package20 s6)
	(at package21 s1)
	(at package22 s1)
	(at package23 s2)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s0 p0-4)
	(path p0-4 s0)
	(path s4 p0-4)
	(path p0-4 s4)
	(path s0 p0-5)
	(path p0-5 s0)
	(path s5 p0-5)
	(path p0-5 s5)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(path s1 p1-3)
	(path p1-3 s1)
	(path s3 p1-3)
	(path p1-3 s3)
	(path s1 p1-5)
	(path p1-5 s1)
	(path s5 p1-5)
	(path p1-5 s5)
	(path s1 p1-7)
	(path p1-7 s1)
	(path s7 p1-7)
	(path p1-7 s7)
	(path s3 p3-6)
	(path p3-6 s3)
	(path s6 p3-6)
	(path p3-6 s6)
	(path s4 p4-5)
	(path p4-5 s4)
	(path s5 p4-5)
	(path p4-5 s5)
	(path s4 p4-6)
	(path p4-6 s4)
	(path s6 p4-6)
	(path p4-6 s6)
	(path s6 p6-2)
	(path p6-2 s6)
	(path s2 p6-2)
	(path p6-2 s2)
	(path s6 p6-5)
	(path p6-5 s6)
	(path s5 p6-5)
	(path p6-5 s5)
	(path s7 p7-2)
	(path p7-2 s7)
	(path s2 p7-2)
	(path p7-2 s2)
	(path s7 p7-4)
	(path p7-4 s7)
	(path s4 p7-4)
	(path p7-4 s4)
	(link s0 s1)
	(link s1 s0)
	(link s0 s2)
	(link s2 s0)
	(link s0 s5)
	(link s5 s0)
	(link s0 s7)
	(link s7 s0)
	(link s1 s6)
	(link s6 s1)
	(link s2 s1)
	(link s1 s2)
	(link s2 s3)
	(link s3 s2)
	(link s2 s4)
	(link s4 s2)
	(link s3 s0)
	(link s0 s3)
	(link s3 s1)
	(link s1 s3)
	(link s3 s7)
	(link s7 s3)
	(link s4 s5)
	(link s5 s4)
	(link s5 s1)
	(link s1 s5)
	(link s6 s0)
	(link s0 s6)
	(link s6 s5)
	(link s5 s6)
	(link s6 s7)
	(link s7 s6)
	(link s7 s1)
	(link s1 s7)
	(link s7 s5)
	(link s5 s7)
)
	(:goal (and
	(at driver1 s4)
	(at driver6 s7)
	(at truck1 s3)
	(at truck2 s7)
	(at truck3 s3)
	(at package1 s5)
	(at package2 s0)
	(at package3 s1)
	(at package4 s0)
	(at package5 s0)
	(at package6 s0)
	(at package7 s3)
	(at package8 s3)
	(at package9 s0)
	(at package10 s5)
	(at package12 s5)
	(at package13 s1)
	(at package14 s0)
	(at package15 s0)
	(at package16 s1)
	(at package17 s3)
	(at package18 s4)
	(at package19 s2)
	(at package21 s4)
	(at package22 s3)
	(at package23 s0)
	))


)

; plan
1. (walk driver5 s0 p0-4)
   deleted: (at driver5 s0)
   added: (at driver5 p0-4)
   goals met: 0 of 26
2. (board-truck driver2 s0 truck1)
   deleted: (at driver2 s0) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 0 of 26
3. (drive-truck driver2 s0 s1 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   goals met: 0 of 26
4. (walk driver5 p0-4 s4)
   deleted: (at driver5 p0-4)
   added: (at driver5 s4)
   goals met: 0 of 26
5. (board-truck driver5 s4 truck3)
   deleted: (at driver5 s4) (empty truck3)
   added: (driving driver5 truck3)
   goals met: 0 of 26
6. (drive-truck driver5 s4 s2 truck3)
   deleted: (at truck3 s4)
   added: (at truck3 s2)
   goals met: 0 of 26
7. (walk driver1 s3 p3-6)
   deleted: (at driver1 s3)
   added: (at driver1 p3-6)
   goals met: 0 of 26
8. (walk driver1 p3-6 s6)
   deleted: (at driver1 p3-6)
   added: (at driver1 s6)
   goals met: 0 of 26
9. (walk driver1 s6 p4-6)
   deleted: (at driver1 s6)
   added: (at driver1 p4-6)
   goals met: 0 of 26
10. (walk driver1 p4-6 s4)
   deleted: (at driver1 p4-6)
   added: (at driver1 s4)
   goals met: 1 of 26
11. (load-truck s1 package6 truck1)
   deleted: (at package6 s1)
   added: (in package6 truck1)
   goals met: 1 of 26
12. (load-truck s1 package22 truck1)
   deleted: (at package22 s1)
   added: (in package22 truck1)
   goals met: 1 of 26
13. (load-truck s1 package21 truck1)
   deleted: (at package21 s1)
   added: (in package21 truck1)
   goals met: 1 of 26
14. (drive-truck driver2 s1 s6 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s6)
   goals met: 1 of 26
15. (load-truck s6 package9 truck1)
   deleted: (at package9 s6)
   added: (in package9 truck1)
   goals met: 1 of 26
16. (drive-truck driver2 s6 s0 truck1)
   deleted: (at truck1 s6)
   added: (at truck1 s0)
   goals met: 1 of 26
17. (unload-truck s0 package9 truck1)
   deleted: (in package9 truck1)
   added: (at package9 s0)
   goals met: 2 of 26
18. (drive-truck driver2 s0 s7 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s7)
   goals met: 2 of 26
19. (load-truck s7 package5 truck1)
   deleted: (at package5 s7)
   added: (in package5 truck1)
   goals met: 2 of 26
20. (drive-truck driver2 s7 s0 truck1)
   deleted: (at truck1 s7)
   added: (at truck1 s0)
   goals met: 2 of 26
21. (load-truck s0 package8 truck1)
   deleted: (at package8 s0)
   added: (in package8 truck1)
   goals met: 2 of 26
22. (unload-truck s0 package6 truck1)
   deleted: (in package6 truck1)
   added: (at package6 s0)
   goals met: 3 of 26
23. (drive-truck driver2 s0 s1 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   goals met: 3 of 26
24. (load-truck s1 package15 truck1)
   deleted: (at package15 s1)
   added: (in package15 truck1)
   goals met: 3 of 26
25. (drive-truck driver2 s1 s0 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   goals met: 3 of 26
26. (unload-truck s0 package5 truck1)
   deleted: (in package5 truck1)
   added: (at package5 s0)
   goals met: 4 of 26
27. (drive-truck driver2 s0 s7 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s7)
   goals met: 4 of 26
28. (load-truck s7 package2 truck1)
   deleted: (at package2 s7)
   added: (in package2 truck1)
   goals met: 4 of 26
29. (drive-truck driver2 s7 s0 truck1)
   deleted: (at truck1 s7)
   added: (at truck1 s0)
   goals met: 4 of 26
30. (unload-truck s0 package2 truck1)
   deleted: (in package2 truck1)
   added: (at package2 s0)
   goals met: 5 of 26
31. (unload-truck s0 package15 truck1)
   deleted: (in package15 truck1)
   added: (at package15 s0)
   goals met: 6 of 26
32. (drive-truck driver2 s0 s1 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   goals met: 6 of 26
33. (load-truck s1 package1 truck1)
   deleted: (at package1 s1)
   added: (in package1 truck1)
   goals met: 6 of 26
34. (drive-truck driver2 s1 s6 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s6)
   goals met: 6 of 26
35. (load-truck s6 package4 truck1)
   deleted: (at package4 s6)
   added: (in package4 truck1)
   goals met: 6 of 26
36. (drive-truck driver2 s6 s0 truck1)
   deleted: (at truck1 s6)
   added: (at truck1 s0)
   goals met: 6 of 26
37. (unload-truck s0 package4 truck1)
   deleted: (in package4 truck1)
   added: (at package4 s0)
   goals met: 7 of 26
38. (drive-truck driver2 s0 s7 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s7)
   goals met: 7 of 26
39. (load-truck s7 package12 truck1)
   deleted: (at package12 s7)
   added: (in package12 truck1)
   goals met: 7 of 26
40. (drive-truck driver2 s7 s5 truck1)
   deleted: (at truck1 s7)
   added: (at truck1 s5)
   goals met: 7 of 26
41. (unload-truck s5 package12 truck1)
   deleted: (in package12 truck1)
   added: (at package12 s5)
   goals met: 8 of 26
42. (unload-truck s5 package1 truck1)
   deleted: (in package1 truck1)
   added: (at package1 s5)
   goals met: 9 of 26
43. (drive-truck driver2 s5 s6 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s6)
   goals met: 9 of 26
44. (load-truck s6 package19 truck1)
   deleted: (at package19 s6)
   added: (in package19 truck1)
   goals met: 9 of 26
45. (drive-truck driver2 s6 s1 truck1)
   deleted: (at truck1 s6)
   added: (at truck1 s1)
   goals met: 9 of 26
46. (drive-truck driver2 s1 s3 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s3)
   goals met: 10 of 26
47. (unload-truck s3 package8 truck1)
   deleted: (in package8 truck1)
   added: (at package8 s3)
   goals met: 11 of 26
48. (unload-truck s3 package22 truck1)
   deleted: (in package22 truck1)
   added: (at package22 s3)
   goals met: 12 of 26
49. (load-truck s3 package14 truck1)
   deleted: (at package14 s3)
   added: (in package14 truck1)
   goals met: 12 of 26
50. (drive-truck driver2 s3 s0 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s0)
   goals met: 11 of 26
51. (unload-truck s0 package14 truck1)
   deleted: (in package14 truck1)
   added: (at package14 s0)
   goals met: 12 of 26
52. (walk driver6 s2 p7-2)
   deleted: (at driver6 s2)
   added: (at driver6 p7-2)
   goals met: 12 of 26
53. (walk driver6 p7-2 s7)
   deleted: (at driver6 p7-2)
   added: (at driver6 s7)
   goals met: 13 of 26
54. (load-truck s2 package7 truck3)
   deleted: (at package7 s2)
   added: (in package7 truck3)
   goals met: 13 of 26
55. (load-truck s2 package23 truck3)
   deleted: (at package23 s2)
   added: (in package23 truck3)
   goals met: 13 of 26
56. (load-truck s2 package17 truck3)
   deleted: (at package17 s2)
   added: (in package17 truck3)
   goals met: 13 of 26
57. (load-truck s2 package10 truck3)
   deleted: (at package10 s2)
   added: (in package10 truck3)
   goals met: 13 of 26
58. (drive-truck driver5 s2 s3 truck3)
   deleted: (at truck3 s2)
   added: (at truck3 s3)
   goals met: 14 of 26
59. (drive-truck driver2 s0 s2 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   goals met: 14 of 26
60. (drive-truck driver2 s2 s4 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s4)
   goals met: 14 of 26
61. (drive-truck driver5 s3 s0 truck3)
   deleted: (at truck3 s3)
   added: (at truck3 s0)
   goals met: 13 of 26
62. (load-truck s4 package3 truck1)
   deleted: (at package3 s4)
   added: (in package3 truck1)
   goals met: 13 of 26
63. (drive-truck driver2 s4 s2 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s2)
   goals met: 13 of 26
64. (unload-truck s2 package19 truck1)
   deleted: (in package19 truck1)
   added: (at package19 s2)
   goals met: 14 of 26
65. (unload-truck s0 package23 truck3)
   deleted: (in package23 truck3)
   added: (at package23 s0)
   goals met: 15 of 26
66. (drive-truck driver2 s2 s4 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s4)
   goals met: 15 of 26
67. (unload-truck s4 package21 truck1)
   deleted: (in package21 truck1)
   added: (at package21 s4)
   goals met: 16 of 26
68. (drive-truck driver2 s4 s2 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s2)
   goals met: 16 of 26
69. (drive-truck driver2 s2 s1 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s1)
   goals met: 16 of 26
70. (drive-truck driver5 s0 s3 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s3)
   goals met: 17 of 26
71. (unload-truck s1 package3 truck1)
   deleted: (in package3 truck1)
   added: (at package3 s1)
   goals met: 18 of 26
72. (drive-truck driver2 s1 s5 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s5)
   goals met: 18 of 26
73. (unload-truck s3 package7 truck3)
   deleted: (in package7 truck3)
   added: (at package7 s3)
   goals met: 19 of 26
74. (unload-truck s3 package17 truck3)
   deleted: (in package17 truck3)
   added: (at package17 s3)
   goals met: 20 of 26
75. (drive-truck driver2 s5 s6 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s6)
   goals met: 20 of 26
76. (load-truck s6 package18 truck1)
   deleted: (at package18 s6)
   added: (in package18 truck1)
   goals met: 20 of 26
77. (drive-truck driver2 s6 s5 truck1)
   deleted: (at truck1 s6)
   added: (at truck1 s5)
   goals met: 20 of 26
78. (drive-truck driver2 s5 s4 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s4)
   goals met: 20 of 26
79. (drive-truck driver5 s3 s7 truck3)
   deleted: (at truck3 s3)
   added: (at truck3 s7)
   goals met: 19 of 26
80. (drive-truck driver5 s7 s5 truck3)
   deleted: (at truck3 s7)
   added: (at truck3 s5)
   goals met: 19 of 26
81. (unload-truck s4 package18 truck1)
   deleted: (in package18 truck1)
   added: (at package18 s4)
   goals met: 20 of 26
82. (load-truck s4 package13 truck1)
   deleted: (at package13 s4)
   added: (in package13 truck1)
   goals met: 20 of 26
83. (drive-truck driver2 s4 s2 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s2)
   goals met: 20 of 26
84. (drive-truck driver2 s2 s1 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s1)
   goals met: 20 of 26
85. (unload-truck s1 package13 truck1)
   deleted: (in package13 truck1)
   added: (at package13 s1)
   goals met: 21 of 26
86. (drive-truck driver2 s1 s3 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s3)
   goals met: 22 of 26
87. (unload-truck s5 package10 truck3)
   deleted: (in package10 truck3)
   added: (at package10 s5)
   goals met: 23 of 26
88. (drive-truck driver5 s5 s6 truck3)
   deleted: (at truck3 s5)
   added: (at truck3 s6)
   goals met: 23 of 26
89. (load-truck s6 package16 truck3)
   deleted: (at package16 s6)
   added: (in package16 truck3)
   goals met: 23 of 26
90. (drive-truck driver5 s6 s1 truck3)
   deleted: (at truck3 s6)
   added: (at truck3 s1)
   goals met: 23 of 26
91. (unload-truck s1 package16 truck3)
   deleted: (in package16 truck3)
   added: (at package16 s1)
   goals met: 24 of 26
92. (drive-truck driver5 s1 s3 truck3)
   deleted: (at truck3 s1)
   added: (at truck3 s3)
   goals met: 25 of 26
93. (walk driver1 s4 p4-5)
   deleted: (at driver1 s4)
   added: (at driver1 p4-5)
   goals met: 24 of 26
94. (walk driver1 p4-5 s5)
   deleted: (at driver1 p4-5)
   added: (at driver1 s5)
   goals met: 24 of 26
95. (board-truck driver1 s5 truck2)
   deleted: (at driver1 s5) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 24 of 26
96. (drive-truck driver1 s5 s7 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s7)
   goals met: 25 of 26
97. (disembark-truck driver1 s7 truck2)
   deleted: (driving driver1 truck2)
   added: (at driver1 s7) (empty truck2)
   goals met: 25 of 26
98. (walk driver1 s7 p7-4)
   deleted: (at driver1 s7)
   added: (at driver1 p7-4)
   goals met: 25 of 26
99. (walk driver1 p7-4 s4)
   deleted: (at driver1 p7-4)
   added: (at driver1 s4)
   goals met: 26 of 26
